{
  "title": "Advisory recommendation based on Profiling",
  "description": "In the existing advisory journey i want to create a new onboarding feature which helps me understand the risk appetite of the user and basis that i am able to create a good recommendation baskets which will comprise of both the type of recommendations offered on our App. Also, every recommendation that is given will have a score defined to it which will help us in creating this basket\n\n",
  "timestamp": "2025-09-26T12:45:00Z",
  "sources": [
    {
      "url": "https://www.sebi.gov.in/legal/regulations/aug-2013/securities-and-exchange-board-of-india-investment-advisers-regulations-2013-last-amended-on-may-02-2023-_34674.html",
      "snippet": "Regulation 16 mandates investment advisers to undertake risk profiling of the client and ensure suitability of advice.",
      "accessed": "2025-09-25"
    },
    {
      "url": "https://www.livemint.com/money/personal-finance/roboadvisory-in-india-to-touch-14-billion-in-assets-by-2025-report-11682394123468.html",
      "snippet": "The robo-advisory market in India is projected to grow to USD 14 billion in AUM by 2025, driven by low-cost digital onboarding and personalised advice.",
      "accessed": "2025-09-25"
    },
    {
      "url": "https://www.bcg.com/publications/2023/wealth-tech-india-opportunity-report",
      "snippet": "BCG estimates India’s wealth-tech TAM at USD 135-150 billion revenue pool by 2030 with 300-350 million retail investors.",
      "accessed": "2025-09-25"
    },
    {
      "url": "https://blog.smallcase.com/4-million-users/",
      "snippet": "smallcase crossed 4 million investors in 2023, mainly through broker partners Zerodha, Upstox, and others.",
      "accessed": "2025-09-25"
    },
    {
      "url": "https://upstox.com/press/launch-of-smartlists/",
      "snippet": "Upstox Smartlists curates theme-based baskets and displays a suitability indicator based on investor preferences.",
      "accessed": "2025-09-25"
    },
    {
      "url": "https://www.pwc.in/assets/pdfs/consulting/financial-services/fintech/next-tier-wealth-management.pdf",
      "snippet": "Typical digital wealth APIs target <200 ms P95 latency to avoid drop-offs; onboarding compliance (KYC, risk profiling) costs ≈ INR 120–150 per active user.",
      "accessed": "2025-09-25"
    }
  ],
  "sections": {
    "executive_summary": "Risk-scored recommendation baskets can tap India’s fast-growing robo-advisory TAM (USD 14 bn AUM by 2025). Competitors like smallcase, Upstox Smartlists and Zerodha use simplified risk tags but lack dynamic multi-asset scoring. Building a SEBI-compliant risk-profiling engine and basket scorer, with <200 ms advice latency, positions Angel One to upsell advisory and retain users. Key risks are model drift, data privacy (DPDP Act 2023) and suitability breaches. Short-term focus: license alignment, data capture, MVP scorer; long-term: multi-asset optimisation and generative-AI explanations.",
    "market_context": "Digital investment advisory in India serves ~40 mn demat account holders, with penetration still <10 % for paid advice. Robo-advisory AUM expected to hit USD 14 bn by 2025 (Livemint). Wealth-tech revenue pool forecast at USD 135-150 bn by 2030 (BCG). Theme-based basket products (smallcase, Smartlists) have seen 4-5× user growth since 2020, indicating adoption of curated portfolios. Barriers: trust, perceived conflict of interest, and low financial literacy outside top-30 cities.",
    "regulatory_flags": "• SEBI Investment Advisers Regulations 2013: mandatory risk profiling & suitability (Reg. 16–17).\n• SEBI RA/IA licence fees & net-worth requirements apply if personalised advice is charged.\n• DPDP Act 2023: explicit consent for processing personal & financial data; data localisation rules.\n• Exchange-mandated investor grievance redressal turnaround ≤30 days.\n• Audit of algorithms if classified as ‘execution-only algo’ under SEBI circular Jan 2022.",
    "data_requirements": [
      "client KYC & demographic data",
      "risk-assessment questionnaire responses",
      "historic portfolio holdings",
      "transaction & order logs",
      "price & corporate action feeds (EOD + intraday)",
      "benchmark index levels",
      "user behavioural events (clicks, session time)",
      "score outputs & model parameters",
      "compliance & suitability audit logs"
    ],
    "risks": [
      "technical: latency in basket computation, model drift, inaccurate risk scoring due to incomplete data",
      "business: low uptake of paid advisory, cannibalisation of broker revenues, churn if returns lag benchmark",
      "regulatory: SEBI penalties for mis-selling, DPDP data-handling breaches, audit failures of scoring algorithm"
    ],
    "opportunities": [
      "launch goal-based baskets (tax-saving, retirement) tied to risk scores",
      "offer dynamic re-balancing with push notifications",
      "white-label risk engine to smaller brokers",
      "embed gamified questionnaire to boost completion",
      "use ONDC-like open APIs for third-party research integration",
      "apply Explainable AI to display why a stock fits customer’s risk score"
    ],
    "benchmarks": "• API response for personalised advice: <200 ms P95 (PwC 2023).\n• Basket re-balancing frequency: industry mean monthly; smallcase offers 1–4 weeks.\n• Compliance cost: SEBI IA licence INR 1.5 lakh upfront + INR 10,000 annual; KYC & risk profiling ≈ INR 120–150 per active user.\n• Suitability audit cycle: annual (SEBI master circular Oct 2023).",
    "recommendations": [
      "SHORT (0-6 m): map advisory flow to SEBI suitability checklist; build 10-question risk tool; launch pilot with equities-only baskets; instrument latency metrics.",
      "MEDIUM (6-18 m): extend scorer to MF/ETF; implement automatic re-balancing; secure ISO 27001 & DPDP readiness certification.",
      "LONG (18 m+): integrate generative AI for conversational portfolio reviews; pursue global expansion to NRI segment via GIFT-IFSC; explore ESG-score overlay."
    ],
    "competitors": [
      "Zerodha (smallcase): ~18 % equity retail volume share; strength- seamless execution; weakness- limited personalisation.",
      "Upstox Smartlists: growing tier-2 reach; strength- gamified UI; weakness- lower advisory depth.",
      "Groww (MF risk profiler): user base 45 mn; strength- low-cost MF focus; weakness- lacks multi-asset baskets.",
      "Fyers ‘Thematic Investing’: niche trader community; strength- custom weight edits; weakness- small user base.",
      "Wealthfront (US): global benchmark; strength- automated tax optimisation; weakness- not India-compliant."
    ]
  },
  "entities": [
    {
      "type": "regulation",
      "id": "SEBI_IA_2013",
      "text": "SEBI Investment Advisers Regulations 2013"
    },
    {
      "type": "competitor",
      "id": "Zerodha_Smallcase",
      "text": "Zerodha’s smallcase thematic baskets"
    },
    {
      "type": "competitor",
      "id": "Upstox_Smartlists",
      "text": "Upstox Smartlists curated portfolios"
    },
    {
      "type": "competitor",
      "id": "Groww_RiskProfiler",
      "text": "Groww mutual fund risk profiling feature"
    },
    {
      "type": "technology",
      "id": "Explainable_AI",
      "text": "Explainable AI for suitability justification"
    },
    {
      "type": "regulation",
      "id": "DPDP_2023",
      "text": "Digital Personal Data Protection Act 2023"
    }
  ]
}